app/Controllers/Alumno.php

    public function mostrar() {

        $alumnoModel =model('AlumnoModel');
        $data['alumnos'] = $alumnoModel->findAll();
---
SELECT *
FROM `alumno`
WHERE `alumno`.`deleted_at` IS NULL

    public function agreg() {
        $gradoModel = model('GradoModel');
        $grupoModel = model('GrupoModel');

        $data['grados'] = $gradoModel->findAll();
        $data['grupos'] = $grupoModel->findAll();
---
SELECT *
FROM `grados`
SELECT *
FROM `grupos`

    public function inser() {
        $alumnoModel = model('AlumnoModel');
        print_r($_POST);

        $data = [
            "nombre"=>$_POST['nombre'],
            "sexo"=>$_POST['sexo'],
            "fechaNacimiento"=>$_POST['fechaNacimiento'],
            "idgrado"=>$_POST['idgrado'],
            "idgrupo"=>$_POST['idgrupo']
        ];
       $alumnoModel->insert($data, false);
---
INSERT INTO `alumno` (`nombre`, `sexo`, `fechaNacimiento`, `idgrado`, `idgrupo`) VALUES ('lalupisviendeazul', 'mujer', '1284-02-12', '2', '2')